'''
Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.

Пример готовой структуры:
[
(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
]

Необходимо собрать аналитику о товарах.
Реализовать словарь, в котором каждый ключ — характеристика товара, например название,
а значение — список значений-характеристик, например список названий товаров.

Пример:
{
“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]
}
'''


def get_info(n):
    keys = ['название', 'цена', 'количество', 'eд']
    values = [input(f'Введите {key}: ') for key in keys]
    return (n, dict(zip(keys, values)))


info_list = [get_info(i) for i in range(1,4)]

info_dic = {}
for inf in info_list:
    for k, v in inf[1].items():
        info_dic[k] = info_dic.get(k,[]) + [v]

[print(f'{k}: {" ".join(v)}') for k, v in info_dic.items()]
